app/views/training_sessions/_enrollments_tab.html.erb


    <% unless @training_session.instructors.include? current_user %>
---
SELECT "instructors".* FROM "instructors" WHERE "instructors"."training_session_id" = 2641