app/views/training_sessions/_training_session_table.html.erb

            Type: <strong><%= training_session.session_type %></strong>
            <% unless training_session.course.blank? %>
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" IN (2405, 2361, 2424, 2413, 2485, 2423, 2744, 2422, 9063, 2408)