app/views/session_ratings/_form_modal.html.erb

            <div class="col-sm-12">
              <%= select_tag "session_rating[session_rating_reason_ids]", options_from_collection_for_select(RatingReason.all, "id", "description"), multiple: true %>
---
SELECT "rating_reasons".* FROM "rating_reasons"