app/controllers/training_sessions_controller.rb

  def index
    if current_user.has_cached_role?(:workshops_admin) || current_user.has_cached_role?(:admin)
      if params[:q].blank?
        @training_sessions = TrainingSession.order(start_date: :desc).includes(:course, :class_location).page params[:page]
      else
        # TODO: we need to move this `import` call to an initializer or something similar
        # TrainingSession.import force: true
        @training_sessions = TrainingSession.search(params[:q]).page(params[:page]).records
---
SELECT  "training_sessions".* FROM "training_sessions" ORDER BY "training_sessions"."start_date" DESC LIMIT $1 OFFSET $2  [["LIMIT", 15], ["OFFSET", 0]]
SELECT "class_locations".* FROM "class_locations" WHERE "class_locations"."id" IN (1, 2262, 2683, 2, 3)
SELECT "courses".* FROM "courses" WHERE "courses"."id" IN (2405, 2361, 2424, 2413, 2485, 2423, 2744, 2422, 9063, 2408)
SELECT COUNT(*) FROM "training_sessions"
SELECT "training_sessions"."id" FROM "training_sessions" INNER JOIN "roles" ON "roles".resource_type IN ('TrainingSession') AND

  def show
    @user_enrollment = Enrollment.find_by(user: current_user,
                                          training_session: @training_session)

    # This variable is used on the General Ledger modal partial
    @general_ledger = GeneralLedger.new
    @session_rating = SessionRating
                      .find_or_initialize_by(user: current_user,
                                             enrollment: @user_enrollment)
---
SELECT  "enrollments".* FROM "enrollments" WHERE "enrollments"."user_id" = 10339 AND "enrollments"."training_session_id" = 2641 LIMIT $1  [["LIMIT", 1]]
SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."training_session_id" = 2641

  def set_training_session
    @training_session = TrainingSession
                        .includes(:general_ledgers, :instructors,
                                  :class_location)
                        .includes(general_ledgers:
                                      %i[financial_account ledger_category])
                        .includes(enrollments: [
                                    { session_rating: :user },
                                    :user
                                  ])
                        .find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 10339], ["LIMIT", 1]]
SELECT "class_locations".* FROM "class_locations" WHERE "class_locations"."id" = 1
SELECT "general_ledgers".* FROM "general_ledgers" WHERE "general_ledgers"."training_session_id" = 2641
SELECT "instructors".* FROM "instructors" WHERE "instructors"."training_session_id" = 2641